#+title: 替换空格

* 替换空格

#+begin_src go :main no
  package main

  import "fmt"

  func main() {
      fmt.Println(replaceSpace("We are happy."))
  }

  func replaceSpace(s string) string {
      b := []byte(s)

      re := make([]byte, 0)

      for i := 0; i < len(b); i++ {
          if b[i] == ' ' {
              re = append(re, []byte("%20")...)
          } else {
              re = append(re, b[i])
          }
      }

      return string(re)
  }
#+end_src

#+RESULTS:
: We%20are%20happy.
